_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_ФормированиеЗаявокНаТСПоДаннымППР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УСОERP_ФормированиеЗаявокНаТСПоДаннымППР</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботыУСП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыУАТ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаТС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ПотребностьВРесурсах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ПотребностьВРесурсах</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагрузкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Трудоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Машиноемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыПланированияСтроительныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_РазделительнаяВедомостьРесурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_РазделительнаяВедомостьРесурсы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоСобственное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСубподряда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СоответствиеОбъектовСтроительстваПунктамНазначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СоответствиеОбъектовСтроительстваПунктамНазначения</Name>
			<Comment>Соответствие объектов строительства пунктам назначения</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПунктНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ПараметрыВыполненияРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ПараметрыВыполненияРабот</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРаботыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРаботыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыПланированияСтроительныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Утверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтатусыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыПланов</Name>
			<Comment>Статусы планов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыПланированияСтроительныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыПланированияСтроительныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месячный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедельноСуточный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыСценариевПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыСценариевПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийРабочий</Name>
					<Comment>Внешний рабочий (для договора с заказчиком)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_Ресурсы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Рабочие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Механизмы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипМеханизма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_ФормированиеЗаявокНаТСПоДаннымППР/Forms/Форма/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура 	ЗаполнитьРаботыНаСервере()									
		
	Запрос = Новый Запрос;
	
	Если НовыйВариант Тогда
		
		Запрос.УстановитьПараметр("ДокументУтверждения",ДокументУтверждения);
		Запрос.УстановитьПараметр("ЕстьРазделительнаяВедомость",Ложь);
		Запрос.УстановитьПараметр("РазделительнаяВедомость",Документы.УСОERP_РазделительнаяВедомость.ПустаяСсылка());
		Запрос.УстановитьПараметр("КопияСценария",ДокументУтверждения.КопияСценария);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_РазделительнаяВедомость.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УСОERP_РазделительнаяВедомость КАК УСОERP_РазделительнаяВедомость
		|ГДЕ
		|	УСОERP_РазделительнаяВедомость.Проведен
		|	И УСОERP_РазделительнаяВедомость.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Утвержден)
		|	И УСОERP_РазделительнаяВедомость.ДокументУтверждения = &ДокументУтверждения";
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Запрос.УстановитьПараметр("ЕстьРазделительнаяВедомость",Истина);
			Запрос.УстановитьПараметр("РазделительнаяВедомость",Выборка.Ссылка);
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По документу утверждения нет разделительной ведомости,данные будет выведены без учета сторонней техники!");
			
		КонецЕсли;		 	
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_РазделительнаяВедомостьРесурсы.Работа КАК Работа,
		|	УСОERP_РазделительнаяВедомостьРесурсы.Ресурс КАК Ресурс,
		|	УСОERP_РазделительнаяВедомостьРесурсы.КоличествоСобственное КАК КоличествоСобственное
		|ПОМЕСТИТЬ ТабРВ
		|ИЗ
		|	Документ.УСОERP_РазделительнаяВедомость.Ресурсы КАК УСОERP_РазделительнаяВедомостьРесурсы
		|ГДЕ
		|	УСОERP_РазделительнаяВедомостьРесурсы.Ссылка = &РазделительнаяВедомость
		//|	И УСОERP_РазделительнаяВедомостьРесурсы.КоличествоСобственное > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УСОERP_СтроительныеРаботы.Ссылка КАК Работа
		|ПОМЕСТИТЬ СписокРабот
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УСОERP_СтроительныеРаботыРаспределение.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.УСОERP_СтроительныеРаботы.Распределение КАК УСОERP_СтроительныеРаботыРаспределение
		|		ГДЕ
		|			УСОERP_СтроительныеРаботыРаспределение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			И НЕ УСОERP_СтроительныеРаботыРаспределение.Ссылка.ПометкаУдаления
		|			И УСОERP_СтроительныеРаботыРаспределение.Ссылка.Владелец = &КопияСценария
		|		
		|		СГРУППИРОВАТЬ ПО
		|			УСОERP_СтроительныеРаботыРаспределение.Ссылка) КАК ВложенныйЗапрос
		|		ПО УСОERP_СтроительныеРаботы.Ссылка = ВложенныйЗапрос.Ссылка
		|ГДЕ
		|	УСОERP_СтроительныеРаботы.Владелец = &КопияСценария
		|	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
		|	И НЕ УСОERP_СтроительныеРаботы.СуммарнаяРабота
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокРабот.Работа КАК Работа,
		|	ЕСТЬNULL(МеханизмыРесурсов.ТипМеханизма, ЗНАЧЕНИЕ(Справочник.ТипыТранспортныхСредств.ПустаяСсылка)) КАК ТипТС,
		|	ЕСТЬNULL(МеханизмыРесурсов.Количество, 0) КАК Количество,
		|	ЕСТЬNULL(УСОERP_СтроительныеРаботыРесурсы.Ресурс, ЗНАЧЕНИЕ(Справочник.УСОERP_Ресурсы.ПустаяСсылка)) КАК Ресурс
		|ПОМЕСТИТЬ ВрТабРезультат
		|ИЗ
		|	СписокРабот КАК СписокРабот
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УСОERP_СтроительныеРаботы.Ресурсы КАК УСОERP_СтроительныеРаботыРесурсы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УСОERP_Ресурсы.Механизмы КАК МеханизмыРесурсов
		|			ПО УСОERP_СтроительныеРаботыРесурсы.Ресурс = МеханизмыРесурсов.Ссылка
		|		ПО СписокРабот.Работа = УСОERP_СтроительныеРаботыРесурсы.Ссылка
		|ГДЕ
		|	МеханизмыРесурсов.ТипМеханизма = &ТипТС
		|	И ВЫБОР
		|			КОГДА &Работа = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СписокРабот.Работа = &Работа
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВрТабРезультат.Работа КАК Работа,
		|	ВрТабРезультат.ТипТС КАК ТипТС,
		|	ЕСТЬNULL(ТабРВ.КоличествоСобственное, ВрТабРезультат.Количество) КАК Количество,
		|	ВрТабРезультат.Ресурс КАК Ресурс
		|ИЗ
		|	ВрТабРезультат КАК ВрТабРезультат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабРВ КАК ТабРВ
		|		ПО (ВЫБОР
		|				КОГДА &ЕстьРазделительнаяВедомость
		|					ТОГДА ВрТабРезультат.Работа = ТабРВ.Работа
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА &ЕстьРазделительнаяВедомость
		|					ТОГДА ВрТабРезультат.Ресурс = ТабРВ.Ресурс
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|ГДЕ
		|	ЕСТЬNULL(ТабРВ.КоличествоСобственное, ВрТабРезультат.Количество) > 0";

	Иначе
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	УСОERP_УтверждениеКалендарногоПланаГрафика.Ссылка КАК ВнутреннийППР
		|ПОМЕСТИТЬ ПоследнийУтвержденныйВнутреннийППР
		|ИЗ
		|	Документ.УСОERP_УтверждениеКалендарногоПланаГрафика КАК УСОERP_УтверждениеКалендарногоПланаГрафика
		|ГДЕ
		|	УСОERP_УтверждениеКалендарногоПланаГрафика.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Утвержден)
		|	И УСОERP_УтверждениеКалендарногоПланаГрафика.ОбъектСтроительства = &ОбъектСтроительства
		|	И УСОERP_УтверждениеКалендарногоПланаГрафика.Организация = &Организация
		|	И УСОERP_УтверждениеКалендарногоПланаГрафика.Проведен
		//|	И УСОERP_УтверждениеКалендарногоПланаГрафика.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И УСОERP_УтверждениеКалендарногоПланаГрафика.Дата <= &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	УСОERP_УтверждениеКалендарногоПланаГрафика.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПоследнийУтвержденныйВнутреннийППР.ВнутреннийППР,
		|	ТЧ_Работы.Работа
		|ПОМЕСТИТЬ СписокРабот
		|ИЗ
		|	ПоследнийУтвержденныйВнутреннийППР КАК ПоследнийУтвержденныйВнутреннийППР
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_УтверждениеКалендарногоПланаГрафика.Работы КАК ТЧ_Работы
		|		ПО ПоследнийУтвержденныйВнутреннийППР.ВнутреннийППР = ТЧ_Работы.Ссылка
		|ГДЕ
		|	ТЧ_Работы.Работа = &Работа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ  РАЗРЕШЕННЫЕ
		|	СписокРабот.ВнутреннийППР,
		|	СписокРабот.Работа,
		|	ЕСТЬNULL(МеханизмыРесурсов.ТипМеханизма, ЗНАЧЕНИЕ(Справочник.ТипыТранспортныхСредств.ПустаяСсылка)) КАК ТипТС,
		|	ЕСТЬNULL(МеханизмыРесурсов.Количество, 0) КАК Количество,
		|	ЕСТЬNULL(ПотребностьВРесурсахСрезПоследних.Ресурс, ЗНАЧЕНИЕ(Справочник.УСОERP_Ресурсы.ПустаяСсылка)) КАК Ресурс
		|ИЗ
		|	СписокРабот КАК СписокРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_ПотребностьВРесурсах.СрезПоследних(
		|				,
		|				ВидПланирования = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.Календарный)
		|					И Ресурс = &Ресурс
		|					И Работа В
		|						(ВЫБРАТЬ
		|							СписокРабот.Работа
		|						ИЗ
		|							СписокРабот КАК СписокРабот)) КАК ПотребностьВРесурсахСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УСОERP_Ресурсы.Механизмы КАК МеханизмыРесурсов
		|			ПО ПотребностьВРесурсахСрезПоследних.Ресурс = МеханизмыРесурсов.Ссылка
		|		ПО СписокРабот.Работа = ПотребностьВРесурсахСрезПоследних.Работа
		|ГДЕ
		|	МеханизмыРесурсов.ТипМеханизма = &ТипТС";
		
		КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаОкончания", 			Объект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", 			Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Организация", 			Объект.Организация);
	Запрос.УстановитьПараметр("Работа",                 Объект.Работа);
	
	Если ЗначениеЗаполнено(Объект.Работа) Тогда 
		//Запрос.УстановитьПараметр("Работа", Объект.Работа);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТЧ_Работы.Работа = &Работа", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ресурс) Тогда 
		Запрос.УстановитьПараметр("Ресурс", Объект.Ресурс);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Ресурс = &Ресурс", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТипТС) Тогда 
		Запрос.УстановитьПараметр("ТипТС", Объект.ТипТС);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "МеханизмыРесурсов.ТипМеханизма = &ТипТС", "Истина");
	КонецЕсли;

	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТЗ_РаботыУСП = Результат.СкопироватьКолонки("Работа, ТипТС, Ресурс");
	
	Для Каждого ТекСтрока Из Результат Цикл
		Если ТекСтрока.Количество <> 0 Тогда
			КоличествоТС = ТекСтрока.Количество;
			Пока КоличествоТС > 0 Цикл
				НоваяСтрока = ТЗ_РаботыУСП.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				КоличествоТС = КоличествоТС - 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Объект.РаботыУСП.Загрузить(ТЗ_РаботыУСП);
	
	
	ТЗ_СписокРабот = ТЗ_РаботыУСП.Скопировать(, "Работа, ТипТС, Ресурс");
	ТЗ_СписокРабот.Колонки.Добавить("Дата", 	Новый ОписаниеТипов("Дата"));
	ТЗ_СписокРабот.Колонки.Добавить("Отметка", 	Новый ОписаниеТипов("Булево"));
	ТЗ_СписокРабот.ЗаполнитьЗначения(Истина, 	"Отметка");
	
	КолонкаКДате = ПолучитьСоответствиеКолонокДатам();
	
	ДанныеПоРаботам = ПолучтьДанныеПоРаботам(ТЗ_СписокРабот);
	
	УО = ЭтаФорма.УсловноеОформление; 
	УО.Элементы.Очистить(); 
	
	Для Каждого ТекСтрока Из Объект.РаботыУСП Цикл
		
		ПараметрыРаботы = ДанныеПоРаботам.Получить(ТекСтрока.Работа);
		Если ПараметрыРаботы <> Неопределено Тогда
			
			Для Каждого ТекДата Из КолонкаКДате Цикл
				
				Если  ПараметрыРаботы.НачалоРаботыПлан = null ИЛИ   ПараметрыРаботы.ОкончаниеРаботыПлан = null Тогда
					Продолжить;
				КонецЕсли;
				
				
				Если ТекДата.Значение >= НачалоДня(ПараметрыРаботы.НачалоРаботыПлан) И ТекДата.Значение <= КонецДня(ПараметрыРаботы.ОкончаниеРаботыПлан) Тогда
					
					ЭлементУО = УО.Элементы.Добавить(); 
					
					Оформляемоеполе 				= ЭлементУО.Поля.Элементы.Добавить(); // Поля таблицы для которых будет действовать оформление 
					Оформляемоеполе.Поле 			= Новый ПолеКомпоновкиДанных("РаботыУСП_" + ТекДата.Ключ); 
					Оформляемоеполе.Использование 	= Истина; 
					
					ЭлементОтбора 					= ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); // отбор текущей строки таблицы 
					ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Объект.РаботыУСП.НомерСтроки"); 
					ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
					ЭлементОтбора.ПравоеЗначение 	= ТекСтрока.НомерСтроки; 
					
					ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФОна",WebЦвета.ЗеленоватоЛимонный); 
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ЗаполнитьРаботы(Команда)									
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьРаботыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура 	СформироватьНаСервере()										
	
	Объект.ДокументыУАТ.Очистить();
	
	ТЗ_СписокРабот = Объект.РаботыУСП.Выгрузить().СкопироватьКолонки("Работа, ТипТС, Ресурс");
	ТЗ_СписокРабот.Колонки.Добавить("Дата", 	Новый ОписаниеТипов("Дата"));
	ТЗ_СписокРабот.Колонки.Добавить("Отметка", 	Новый ОписаниеТипов("Булево"));
	
	КолонкаКДате = ПолучитьСоответствиеКолонокДатам();
	
	Для Каждого ТекСтрока Из Объект.РаботыУСП Цикл
		
		Для Каждого ТекДата Из КолонкаКДате Цикл
			НоваяСтрока = ТЗ_СписокРабот.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			НоваяСтрока.Дата 	= ТекДата.Значение;
			Выполнить("НоваяСтрока.Отметка = ТекСтрока." + ТекДата.Ключ + ";");
		КонецЦикла;
				
	КонецЦикла;
	
   Запрос = Новый Запрос;
   Запрос.УстановитьПараметр("ДокументУтверждения",ДокументУтверждения);
   
   Запрос.Текст = 
   "ВЫБРАТЬ
   |	УСОERP_РазделительнаяВедомостьРаботы.Работа КАК Работа,
   |	УСОERP_РазделительнаяВедомостьРаботы.Подразделение КАК Подразделение,
   |	УСОERP_РазделительнаяВедомостьРаботы.Контрагент КАК Контрагент
   |ИЗ
   |	Документ.УСОERP_РазделительнаяВедомость.Работы КАК УСОERP_РазделительнаяВедомостьРаботы
   |ГДЕ
   |	УСОERP_РазделительнаяВедомостьРаботы.Ссылка.ДокументУтверждения = &ДокументУтверждения
   |	И УСОERP_РазделительнаяВедомостьРаботы.Ссылка.Проведен
   |	И УСОERP_РазделительнаяВедомостьРаботы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Утвержден)
   |	И НЕ УСОERP_РазделительнаяВедомостьРаботы.Работа.СуммарнаяРабота
   |	И УСОERP_РазделительнаяВедомостьРаботы.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)";
   
   ТабРаботПодразделений = Запрос.Выполнить().Выгрузить();   
   
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЗ_СписокРабот.Работа,
		|	ТЗ_СписокРабот.Ресурс,
		|	ТЗ_СписокРабот.ТипТС,
		|	ТЗ_СписокРабот.Дата,
		|	ТЗ_СписокРабот.Отметка
		|ПОМЕСТИТЬ СписокРабот
		|ИЗ
		|	&ТЗ_СписокРабот КАК ТЗ_СписокРабот
		|ГДЕ
		|	ТЗ_СписокРабот.Отметка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокРабот.Работа КАК Работа,
		|	СписокРабот.Ресурс КАК Ресурс,
		|	СписокРабот.ТипТС КАК ТипТС,
		|	СписокРабот.Дата КАК Дата,
		|	СписокРабот.Отметка,
		|	ЕСТЬNULL(РесурсыСрезПоследних.Регистратор, ЗНАЧЕНИЕ(Документ.УСОERP_РазделительнаяВедомость.ПустаяСсылка)) КАК Регистратор
		|ИЗ
		|	СписокРабот КАК СписокРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_РазделительнаяВедомостьРесурсы.СрезПоследних(
		|				&ДатаОкончания,
		|				ОбъектСтроительства = &ОбъектСтроительства
		|					И Период >= &ДатаНачала
		|					И Регистратор.Организация = &Организация) КАК РесурсыСрезПоследних
		|		ПО СписокРабот.Работа = РесурсыСрезПоследних.Работа
		|			И СписокРабот.Ресурс = РесурсыСрезПоследних.Ресурс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СписокРабот.ТипТС,
		|	уатМоделиТС.Ссылка КАК ТребованиеКТС
		|ИЗ
		|	СписокРабот КАК СписокРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатМоделиТС КАК уатМоделиТС
		|		ПО СписокРабот.ТипТС = уатМоделиТС.ТипТС
		|ГДЕ
		|	НЕ уатМоделиТС.Ссылка ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("ТЗ_СписокРабот", 			ТЗ_СписокРабот);
	Запрос.УстановитьПараметр("ОбъектСтроительства", 		Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Организация", 				Объект.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", 				Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 				Объект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ОтборПоПризнакуУтверждена", 	Ложь);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка 			= Результат[1].Выбрать();
	ТЗ_Модель 			= Результат[2].Выгрузить();
	СоответствиеРаботы	= ПолучтьДанныеПоРаботам(ТЗ_СписокРабот);
	
	Пока Выборка.Следующий() Цикл 
	
		Попытка
			НовыйЗаказНаТС = Документы.уатЗаказГрузоотправителя.СоздатьДокумент();
		Исключение 
			ЗаписьЖурналаРегистрации("Ошибка! Не удалось создать документ: ""Заказ на ТС"".", 
									УровеньЖурналаРегистрации.Ошибка, 
									Метаданные.Документы.уатЗаказГрузоотправителя);
									Сообщить(ОписаниеОшибки());
			Продолжить;
		КонецПопытки;

		НовыйЗаказНаТС.Дата 				= ТекущаяДата();				
		//НовыйЗаказНаТС.КрайнийСрокОтработки = Выборка.Дата;
		НовыйЗаказНаТС.Организация 			= Объект.Организация;
		НовыйЗаказНаТС.ТребованиеКТСТипТС	= Выборка.ТипТС;
		НовыйЗаказНаТС.ОбъектСтроительства 	= Объект.ОбъектСтроительства;
		НовыйЗаказНаТС.СтроительнаяРабота	= Выборка.Работа;
		НовыйЗаказНаТС.Ответственный		= Пользователи.ТекущийПользователь();
		
		График = ?(ЗначениеЗаполнено(Выборка.Работа.ГрафикРаботы),Выборка.Работа.ГрафикРаботы,Выборка.Работа.Владелец.Владелец.ГрафикРаботы);

		НовыйЗаказНаТС.ГрафикСтроительнойРаботы				= График;		
		
		Если ТипЗнч(НовыйЗаказНаТС.Метаданные().Реквизиты.ГрафикСтроительнойРаботы) <> Тип("СправочникСсылка.Календари") Тогда
			
			ГрафикСотрудника = Справочники.ГрафикиРаботыСотрудников.НайтиПоРеквизиту("ПроизводственныйКалендарь",График.ПроизводственныйКалендарь);
			НовыйЗаказНаТС.ГрафикСтроительнойРаботы				= ГрафикСотрудника;
			
		КонецЕсли;

		//НовыйЗаказНаТС.ГрафикСтроительнойРаботы				= Выборка.Работа.ГрафикРаботы;
		НовыйЗаказНаТС.СценарийПланированияСтроительства	= Выборка.Работа.Владелец;
		НовыйЗаказНаТС.РаботаТехникиНаОбъектеСтроительства 	= Истина; 				
		
		ДанныеПоРаботе = СоответствиеРаботы.Получить(Выборка.Работа);
		
		Если ДанныеПоРаботе <> Неопределено Тогда
			НовыйЗаказНаТС.ОбъемСтроительнойРаботы 				= ДанныеПоРаботе.ОбъемРаботы;
			НовыйЗаказНаТС.ЕдиницаИзмеренияСтроительнойРаботы 	= ДанныеПоРаботе.ЕдиницаОбъема;
			НовыйЗаказНаТС.НачалоСтроительнойРаботы 			= ДанныеПоРаботе.НачалоРаботыПлан;
			НовыйЗаказНаТС.ОкончаниеСтроительнойРаботы 			= ДанныеПоРаботе.ОкончаниеРаботыПлан;
		КонецЕсли;
		
		Если Выборка.Работа.Владелец.НовыйВариант Тогда
			
			НовыйЗаказНаТС.ОбъемСтроительнойРаботы 				= Выборка.Работа.ОбъемРаботы;
			НовыйЗаказНаТС.ЕдиницаИзмеренияСтроительнойРаботы 	= Выборка.Работа.ЕдиницаОбъема;
			НовыйЗаказНаТС.НачалоСтроительнойРаботы 			= Выборка.Работа.ДатаНачала;
			НовыйЗаказНаТС.ОкончаниеСтроительнойРаботы 			= Выборка.Работа.ДатаОкончания;
			
			
			СтрокаДаты = Выборка.Работа.Распределение.Найти(НачалоДня(Выборка.Дата));
			
			Если СтрокаДаты <> Неопределено Тогда
				НовыйЗаказНаТС.ОбъемСтроительнойРаботы = СтрокаДаты.Количество;
				НовыйЗаказНаТС.НачалоСтроительнойРаботы = НачалоДня(СтрокаДаты.Дата);
				НовыйЗаказНаТС.ОкончаниеСтроительнойРаботы = КонецДня(СтрокаДаты.Дата);
			КонецЕсли;
			
			СтрокаРаботы = ТабРаботПодразделений.Найти(Выборка.Работа);
			
			Если СтрокаРаботы <> Неопределено Тогда
				
				НовыйЗаказНаТС.Контрагент = СтрокаРаботы.Подразделение;
								
			КонецЕсли;
			
			НовыйЗаказНаТС.Комментарий = "По работе "+Выборка.Работа+" ("+Выборка.Работа.КодСДР+") по ресурсу "+Выборка.Ресурс+" ( "+Выборка.ТипТС+")";
			
		КонецЕсли;
		
		МассивМодель = ТЗ_Модель.НайтиСтроки(Новый Структура("ТипТС", Выборка.ТипТС));
		Если МассивМодель.Количество() = 1 Тогда
			НовыйЗаказНаТС.ТребованиеКТС = МассивМодель[0].ТребованиеКТС;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ОбъектСтроительства", Объект.ОбъектСтроительства);
		
		МестонахождениеОбъектаСтроительства = РегистрыСведений.УСОERP_СоответствиеОбъектовСтроительстваПунктамНазначения.СрезПоследних(ТекущаяДата(), Отбор);
		Если МестонахождениеОбъектаСтроительства.Количество() = 1 Тогда
			НовыйЗаказНаТС.АдресОтправления = МестонахождениеОбъектаСтроительства[0].ПунктыНазначения;
			НовыйЗаказНаТС.АдресНазначения 	= МестонахождениеОбъектаСтроительства[0].ПунктыНазначения;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			НоваяСтрокаТовар = НовыйЗаказНаТС.Товары.Добавить();
			НоваяСтрокаТовар.Номенклатура 		= Объект.Номенклатура;
			НоваяСтрокаТовар.ЕдиницаИзмерения 	= Объект.Номенклатура.ЕдиницаИзмерения;
			НоваяСтрокаТовар.Количество			= 1;
		КонецЕсли;
		
		Попытка
			НовыйЗаказНаТС.Записать(РежимЗаписиДокумента.Запись);
		Исключение 
			ЗаписьЖурналаРегистрации("Ошибка! Не удалось записать документ: ""Заказ на ТС"".", 
									УровеньЖурналаРегистрации.Ошибка, 
									Метаданные.Документы.уатЗаказГрузоотправителя);
									Сообщить(ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		НовыйДокументУАТ = Объект.ДокументыУАТ.Добавить();
		НовыйДокументУАТ.ЗаказНаТС = НовыйЗаказНаТС.Ссылка;
	
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура 	Сформировать(Команда)										
	
	СформироватьНаСервере();
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаДокументыУАТ;
	
КонецПроцедуры

&НаСервере
Процедура 	ПеренестиПериодВТаблицу()									
		
	МассивРеквизитов = ПолучитьРекизитыПериода();
	
	МассивУдаляемыхРеквизитов = Новый Массив;
	
	Для Каждого ТекСтрока Из МассивРеквизитов Цикл
		Если Элементы.Найти("РаботыУСП_" + ТекСтрока.Имя) <> Неопределено Тогда
			Выполнить("Элементы.Удалить(Элементы." + "РаботыУСП_" + ТекСтрока.Имя +");");
		КонецЕсли;
		МассивУдаляемыхРеквизитов.Добавить(ТекСтрока.Путь + "." + ТекСтрока.Имя);
	КонецЦикла;
	
	ИзменитьРеквизиты(,МассивУдаляемыхРеквизитов); 
	
	ДатаНачала 		= Объект.Период.ДатаНачала;
	ДатаОкончания 	= Объект.Период.ДатаОкончания;
	Итератор		= 0;
	
	Пока НачалоДня(ДатаНачала) <> НачалоДня(ДатаОкончания) Цикл
		
		Итератор = Итератор + 1;
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(СтрЗаменить(Строка("Дата" + Итератор), Символы.НПП, ""), Новый ОписаниеТипов("Булево"), "Объект.РаботыУСП"));
		
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов); 
				
		НоваяКолонка = Элементы.Добавить(СтрЗаменить(Строка("РаботыУСП_Дата" + Итератор), Символы.НПП, ""), Тип("ПолеФормы"), Элементы.РаботыУСП);
		НоваяКолонка.Вид 			= ВидПоляФормы.ПолеФлажка;
		НоваяКолонка.Заголовок 		= Формат(ДатаНачала, "ДФ = дд.ММ.гг"); 
		НоваяКолонка.ПутьКДанным 	= СтрЗаменить(Строка("Объект.РаботыУСП.Дата" + Итератор), Символы.НПП, "");
		
		ДатаНачала = ДатаНачала + 86400;
	
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура 	ПериодПриИзменении(Элемент)									
	
	ПеренестиПериодВТаблицу();
	
КонецПроцедуры

&НаСервере
Функция 	ПолучитьСоответствиеКолонокДатам()							
	
	КолонкаКДате = Новый Соответствие;
		
	МассивРеквизитов = ПолучитьРекизитыПериода();
	Для Каждого ТекРеквизит Из МассивРеквизитов Цикл
		НомерКолонки = Число(СтрЗаменить(ТекРеквизит.Имя, "Дата", ""));
		Если ТипЗнч(НомерКолонки) = Тип("Число") Тогда
			КолонкаКДате.Вставить(ТекРеквизит.Имя, НачалоДня(Объект.Период.ДатаНачала) + (НомерКолонки - 1) * 86400);
		КонецЕсли;
	КонецЦикла;
	
	Возврат КолонкаКДате;
	
КонецФункции

&НаСервере
Функция 	ПолучитьРекизитыПериода()									
	
	МассивРеквизитов = ЭтаФорма.ПолучитьРеквизиты("Объект.РаботыУСП");
	МассивРеквизитов.Удалить(0); // Номер строки
	МассивРеквизитов.Удалить(0); // Работа
	МассивРеквизитов.Удалить(0); // Ресурс
	МассивРеквизитов.Удалить(0); // Тип ТС
	МассивРеквизитов.Удалить(МассивРеквизитов.Количество() - 1); // Количество строк
	
	Возврат МассивРеквизитов;
	
КонецФункции

&НаСервере
Функция		ПолучтьДанныеПоРаботам(СписокРабот)							
	
	УстановитьПривилегированныйРежим(Истина);
	
	СоответствиеДанных	= Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЗ_СписокРабот.Работа,
		|	ТЗ_СписокРабот.Ресурс,
		|	ТЗ_СписокРабот.ТипТС,
		|	ТЗ_СписокРабот.Дата,
		|	ТЗ_СписокРабот.Отметка
		|ПОМЕСТИТЬ СписокРабот
		|ИЗ
		|	&ТЗ_СписокРабот КАК ТЗ_СписокРабот
		|ГДЕ
		|	ТЗ_СписокРабот.Отметка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтроительныеРаботы.Ссылка,
		|	СтроительныеРаботы.Владелец,
		|	СтроительныеРаботы.Владелец КАК СценарийПланирования,
		|	СтроительныеРаботы.Владелец.Владелец КАК ОбъектСтроительства,
		|	СтроительныеРаботы.Родитель,
		|	СтроительныеРаботы.СуммарнаяРабота,
		|	ПараметрыВыполненияРабот.Работа,
		|	МАКСИМУМ(ПараметрыВыполненияРабот.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_СрезПоследних
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы КАК СтроительныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_ПараметрыВыполненияРабот.СрезПоследних(
		|				&ДатаОкончания,
		|				Работа В
		|						(ВЫБРАТЬ
		|							СписокРабот.Работа
		|						ИЗ
		|							СписокРабот КАК СписокРабот)
		|					И ВидПланирования = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.Календарный)
		|					И Утверждена = &ОтборПоПризнакуУтверждена) КАК ПараметрыВыполненияРабот
		|		ПО СтроительныеРаботы.Ссылка = ПараметрыВыполненияРабот.Работа
		|ГДЕ
		|	СтроительныеРаботы.Ссылка В
		|			(ВЫБРАТЬ
		|				СписокРабот.Работа
		|			ИЗ
		|				СписокРабот КАК СписокРабот)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПараметрыВыполненияРабот.Работа,
		|	СтроительныеРаботы.Ссылка,
		|	СтроительныеРаботы.Владелец,
		|	СтроительныеРаботы.Владелец.Владелец,
		|	СтроительныеРаботы.Родитель,
		|	СтроительныеРаботы.СуммарнаяРабота,
		|	СтроительныеРаботы.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтроительныеРаботы.Ссылка,
		|	СтроительныеРаботы.Владелец,
		|	СтроительныеРаботы.Владелец КАК СценарийПланирования,
		|	СтроительныеРаботы.Владелец.Владелец КАК ОбъектСтроительства,
		|	СтроительныеРаботы.Родитель,
		|	СтроительныеРаботы.СуммарнаяРабота,
		|	ВЫБОР
		|		КОГДА СтроительныеРаботы.ГрафикРаботы <> ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)
		|			ТОГДА СтроительныеРаботы.ГрафикРаботы
		|		ИНАЧЕ СтроительныеРаботы.Владелец.Владелец.ГрафикРаботы
		|	КОНЕЦ КАК ГрафикРаботы,
		|	ЕСТЬNULL(ПараметрыВыполненияРабот.НачалоРаботыПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоРаботыПлан,
		|	ЕСТЬNULL(ПараметрыВыполненияРабот.ОкончаниеРаботыПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ОкончаниеРаботыПлан,
		|	ЕСТЬNULL(ПараметрыВыполненияРабот.ДлительностьПлан, 0) КАК ДлительностьПлан,
		|	ПараметрыВыполненияРабот.ЕдиницаДлительности,
		|	ЕСТЬNULL(ПараметрыВыполненияРабот.ОбъемРаботы, 0) КАК ОбъемРаботы,
		|	ЕСТЬNULL(ПараметрыВыполненияРабот.ЕдиницаОбъема, """") КАК ЕдиницаОбъема,
		|	ЕСТЬNULL(ПараметрыВыполненияРабот.Утверждена, ЛОЖЬ) КАК Утверждена,
		|	ЕСТЬNULL(ПараметрыВыполненияРабот.АвторИзменения, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК АвторИзменения
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы КАК СтроительныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезПоследних КАК ВТ_СрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_ПараметрыВыполненияРабот.СрезПоследних(
		|					&ДатаОкончания,
		|					Работа В
		|							(ВЫБРАТЬ
		|								СписокРабот.Работа
		|							ИЗ
		|								СписокРабот КАК СписокРабот)
		|						И ВидПланирования = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.Календарный)
		|						И Утверждена = &ОтборПоПризнакуУтверждена) КАК ПараметрыВыполненияРабот
		|			ПО ВТ_СрезПоследних.Работа = ПараметрыВыполненияРабот.Работа
		|				И ВТ_СрезПоследних.Период = ПараметрыВыполненияРабот.Период
		|		ПО СтроительныеРаботы.Ссылка = ВТ_СрезПоследних.Работа
		|ГДЕ
		|	СтроительныеРаботы.Ссылка В
		|			(ВЫБРАТЬ
		|				СписокРабот.Работа
		|			ИЗ
		|				СписокРабот КАК СписокРабот)";
	Запрос.УстановитьПараметр("ТЗ_СписокРабот", 			СписокРабот);
	Запрос.УстановитьПараметр("ОбъектСтроительства", 		Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Организация", 				Объект.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", 				Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 				Объект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ОтборПоПризнакуУтверждена", 	Ложь);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	               
	Для Каждого ТекСтрока Из Объект.РаботыУСП Цикл
		
		Если НовыйВариант Тогда
			
		Результат = Новый Структура;
		Результат.Вставить("Ссылка", 					ТекСтрока.Работа);
		Результат.Вставить("Владелец", 					ДокументУтверждения.СценарийПланирования);		
		Результат.Вставить("СценарийПланирования", 		ДокументУтверждения.СценарийПланирования);			
		Результат.Вставить("ОбъектСтроительства", 		ДокументУтверждения.ОбъектСтроительства);
		Результат.Вставить("Родитель", 					ТекСтрока.Работа.Родитель);
		Результат.Вставить("СуммарнаяРабота", 			ТекСтрока.Работа.СуммарнаяРабота);
		Результат.Вставить("ГрафикРаботы", 				ТекСтрока.Работа.ГрафикРаботы);
		Результат.Вставить("НачалоРаботыПлан", 			ТекСтрока.Работа.ДатаНачала);
		Результат.Вставить("ОкончаниеРаботыПлан", 		ТекСтрока.Работа.ДатаОкончания);
		Результат.Вставить("ДлительностьПлан", 			ТекСтрока.Работа.Длительность);
		Результат.Вставить("ЕдиницаДлительности", 		ТекСтрока.Работа.ЕдиницаДлительности);
		Результат.Вставить("ОбъемРаботы",           	ТекСтрока.Работа.ОбъемРаботы);
		Результат.Вставить("ЕдиницаОбъема",           	ТекСтрока.Работа.ЕдиницаОбъема);
		Результат.Вставить("Утверждена",           		Истина);
		Результат.Вставить("ЕдиницаОбъема",           	Справочники.Пользователи.ПустаяСсылка());
		Результат.Вставить("ВидПланирования",           Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный);
		Результат.Вставить("КритическаяРабота",         ТекСтрока.Работа.КритическаяРабота);

			
			СоответствиеДанных.Вставить(ТекСтрока.Работа, Результат);
			
			Продолжить;
			
		КонецЕсли;
		
		Результат = Новый Структура;
		Результат.Вставить("Ссылка", 					Справочники.УСОERP_СтроительныеРаботы.ПустаяСсылка());
		Результат.Вставить("Владелец", 					Справочники.УСОERP_СценарииПланированияПроектовСтроительства.ПустаяСсылка());		
		Результат.Вставить("СценарийПланирования", 		Справочники.УСОERP_СценарииПланированияПроектовСтроительства.ПустаяСсылка());			
		Результат.Вставить("ОбъектСтроительства", 		Справочники.СМ_ОбъектыСтроительства.ПустаяСсылка());
		Результат.Вставить("Родитель", 					Справочники.УСОERP_СтроительныеРаботы.ПустаяСсылка());
		Результат.Вставить("СуммарнаяРабота", 			Ложь);
		Результат.Вставить("ГрафикРаботы", 				Справочники.Календари.ПустаяСсылка());
		Результат.Вставить("НачалоРаботыПлан", 			'00010101');
		Результат.Вставить("ОкончаниеРаботыПлан", 		'00010101');
		Результат.Вставить("ДлительностьПлан", 			0);
		Результат.Вставить("ЕдиницаДлительности", 		Перечисления.ЕдиницыИзмеренияВремени.ПустаяСсылка());
		Результат.Вставить("ОбъемРаботы",           	0);
		Результат.Вставить("ЕдиницаОбъема",           	Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
		Результат.Вставить("Утверждена",           		Ложь);
		Результат.Вставить("ЕдиницаОбъема",           	Справочники.Пользователи.ПустаяСсылка());
		Результат.Вставить("ВидПланирования",           Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.ПустаяСсылка());
		Результат.Вставить("КритическаяРабота",         Ложь);

		НайденнаяСтрока = РезультатЗапроса.Найти(ТекСтрока.Работа, "Ссылка");
		Если НайденнаяСтрока <> Неопределено И ЗначениеЗаполнено(ТекСтрока.Работа) Тогда 
			ЗаполнитьЗначенияСвойств(Результат, НайденнаяСтрока);			
		КонецЕсли;			
		СоответствиеДанных.Вставить(ТекСтрока.Работа, Результат);
	КонецЦикла;	
	
	Возврат СоответствиеДанных;

КонецФункции

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)
	ОбъектСтроительстваПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбъектСтроительстваПриИзмененииНаСервере()
	
	СценарийПланирования = Справочники.УСОERP_СценарииПланированияПроектовСтроительства.ПустаяСсылка();
	
	Выборка = Справочники.УСОERP_СценарииПланированияПроектовСтроительства.Выбрать(,Объект.ОбъектСтроительства);
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.ПометкаУдаления И Выборка.ВидСценария = Перечисления.УСОERP_ВидыСценариевПланирования.Рабочий И Выборка.Организация = Объект.Организация Тогда
			
			СценарийПланирования = Выборка.Ссылка;
			
			Если СценарийПланирования.НовыйВариант Тогда
				
				ДокументУтверждения = УСОERP_ЗащищенныеФункцииСервер.ПолучитьПоследнийДокументУтверждения(Объект.ОбъектСтроительства,Объект.Организация,СценарийПланирования,ТекущаяДата());
				
				НовыйВариант = Истина;
				
				ПеренестиПериодВТаблицу();
				
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДокументУтвержденияПриИзмененииНаСервере()
	
	НовыйВариант = ДокументУтверждения.СценарийПланирования.НовыйВариант = Истина;
    Объект.Работа = "";
	Если НовыйВариант Тогда
		СценарийПланирования = ДокументУтверждения.КопияСценария;
		ПеренестиПериодВТаблицу();
	Иначе
		ОбъектСтроительстваПриИзмененииНаСервере();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияПриИзменении(Элемент)
	ДокументУтвержденияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияОчистка(Элемент, СтандартнаяОбработка)
	ДокументУтвержденияПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РаботаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
  Объект.Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
КонецПроцедуры

#КонецОбласти
